app/views/articles/index.html.erb

    <%= link_to article.name, article %>
    <span class="comments">(<%= pluralize(article.comments.size, 'comment') %>)</span>
---
SELECT COUNT(*) FROM "comments" WHERE ("comments".article_id = 1)