app/controllers/articles_controller.rb

  def index
    @search = Article.search do
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(params[:article])
    if @article.save
---
INSERT INTO "articles" ("name", "content", "created_at", "updated_at", "published_at") VALUES ('Artigo 1', 'kdjhvjkshbvjkschvjkcxbvhjkdfhbjkhdskjfbhjdgbd', '2014-05-08 18:11:15.407190', '2014-05-08 18:11:15.407190', NULL)